{
    "status": 1,
    "message": [
        "success"
    ],
    "messageCode": [
        "success"
    ],
    "data": [
        {
            "heading": "*UK's lowest fixed price fibre broadband",
            "caveat": [
                {
                    "title": "UK's lowest fixed price fibre broadband",
                    "content": "UK's lowest fixed price Fibre Broadband when compared to major broadband providers."
                }
            ]
        },
        {
            "heading": "Our Fixed Price Plans",
            "caveat": [
                {
                    "title": "Our Fixed Price Plans",
                    "content": "Fixed Price Plans refer to Fast Broadbandand Faster Fibre plans. These Fixed Price Plans will\n            have no price increases on the monthly charges during the minimum contract period (this does not include \n            Boosts or other charges, such as movies or calls). Fixed Price Plans are available to new and existing \n            TalkTalk customers. Existing customers need to sign a new contract to be eligible and will be subject to \n            the Terms for Existing Customer. We may need to arrange an engineer to \n            set you up; we will contact you if that's the case. Price includes: line rental charges;\n            unlimited calls between TalkTalk landlines up to 180 minutes; anti-virus protection for\n            one device; and access to TalkTalk TV Store (with on-demand movies and TV content), Netflix and BT Sport \n            (all available at an additional cost to your package). \n            \n            Unless you take a separate Calling Boost, all calls are charged at the standard rate of 12.5p per minute \n            (13.5p from 01/08/2017) for UK Landlines. Calls to 084, 087, 09 and 118 numbers have an access charge of \n            7.5p per minute (10.5p from 01/08/2017). All other chargeable calls are subject to a connection fee \n            (currently 18p, increasing to 20p from 01/08/2017). \n            \n            Packages are subject to certain conditions and we need you to pay by Direct Debit (our full \n            <a href = 'http://www.talktalk.co.uk/media/pdf/legal/TALKTALK_Customer_Terms_and_Conditions_v20160621.pdf'>\n            Terms and Conditions</a> have all the info)."
                }
            ]
        },
        {
            "heading": "Fast Broadband",
            "caveat": [
                {
                    "title": "Fast Broadband",
                    "content": "Latest offer fixed for the entire minimum term of your contract (&pound;19.95 per month for 24 month contract, &pound;27.00 per month for 18 month contract, &pound;27.00 per month for 12 month contract) &pound;27.00 per month thereafter. Offer is available until 08/02/2018. The Plan has broadband with speeds of up to 17Mb (your exact speed estimate will be given at point of sale)."
                }
            ]
        },
        {
            "heading": "Faster Fibre",
            "caveat": [
                {
                    "title": "Faster Fibre",
                    "content": "Latest offer fixed for the entire minimum term of your contract (&pound;33.50 per month for 24 month contract, &pound;33.50 per month for 18 month contract, &pound;33.50 per month for 12 month contract) &pound;33.50 per month thereafter. Offer is available until 31/12/1969. The Plan has fibre broadband with speeds of up to 38Mb (your exact speed estimate will be given at point of sale)."
                }
            ]
        },
        {
            "heading": "Ultra Fibre Optic",
            "caveat": [
                {
                    "title": "Ultra Fibre Optic",
                    "content": "Ultra Fibre Optic Broadband (24 months contract): &pound;21.70/ month including line rental and\n                installation charge. 24 months min. term, &pound;33.50 thereafter. Offer is available until 31/03/2018.\n                <br />Subject to status, acceptance & availability in your area. Payment by Direct Debit only.\n                The UFO connection to your home is 1Gb (1000Mb). Obtainable speeds are subject to the capability of\n                your device, your home environment and the number of connected devices in your home. For maximum\n                speeds, connect via an Ethernet cable. 20x faster than the UK's average fibre: York's Ultra Fibre\n                Optic from TalkTalk delivers speeds more than 900Mb/s compared to the UK average Fibre broadband (FTTC)\n                download speed (44.9Mb/s) from OFCOM UK Home Broadband Performance report March 2017. Excludes calls.\n                Standard rate for calling UK landlines is 13.5p/min. Calls to 0845, 087, 09 and 118 numbers will have\n                an access charge of 10.5p. All other chargeable calls subject to 20p connection fee. Prices correct as\n                at 7/1/2018. See our full\n                <a href=\"http://www.talktalk.co.uk/legal/terms/talktalk-product-terms.html?utype=talktalk\">terms\n                and conditions</a>."
                }
            ]
        },
        {
            "heading": "TalkTalk TV Box",
            "caveat": [
                {
                    "title": "TalkTalk TV Box",
                    "content": "&pound;25 TalkTalk TV Box. Features pause and rewind (for up to 30 minutes), access to around 80 Freeview channels and 7 day catch up (available for certain channels only and not all programmes available on channels where catch up is available), and access to TV Boosts and on demand content. Freeview channels are subject to location and other factors. Please see <a href='https://www.freeview.co.uk/'>Freeview</a> for more information. You need to connect your TalkTalk TV Box to the internet and your TV aerial."
                }
            ]
        },
        {
            "heading": "TalkTalk TV Plus Box",
            "caveat": [
                {
                    "title": "TalkTalk TV Plus Box",
                    "content": "&pound;25 TV Plus Box offer applies when taken with the TV Select Boost (at &pound;7 per month). Features pause and rewind (for up to 2 hours), record (up to 180 Standard Definition hours), access to around 80 Freeview channels, 7 day catch up (available for certain channels only and not all programmes available on channels where catch up is available), and access to TV Boosts and on demand content. Freeview channels are subject to location and other factors. Please see <a href='https://www.freeview.co.uk/'>Freeview</a> for more information. You need to connect your TalkTalk TV Box to the internet and your TV aerial."
                }
            ]
        },
        {
            "heading": "TV Boosts",
            "caveat": [
                {
                    "title": "TV Boosts",
                    "content": "Monthly Boost charges are additional to your Fixed Price Plan and are subject to change. All \n            Boosts have minimum duration of 1 month. Once added, you'll continue to receive the Boost until you \n            opt-out or your broadband service ends (we need 48 hours' notice to terminate). We'll have the Boost \n            activated as soon as possible but will confirm when it goes live with an activation email. Boosts are \n            billed in advance. \n            \n            You need a minimum broadband line speed of 2Mb to receive on-demand Boosts and 5Mb to receive Boosts with \n            linear channels. Channel availability will depend on where you live, how strong your broadband signal is, \n            and your TV aerial reception. Channels may be subject to change. \n            \n            In order to receive Freeview channels you need a working TV aerial."
                }
            ]
        },
        {
            "heading": "Calling Boosts",
            "caveat": [
                {
                    "title": "Calling Boosts",
                    "content": "Monthly Boost charges are additional to your Fixed Price Plan and are subject to change. All Boosts have minimum duration of 1 month. Once added, you'll continue to receive the Boost until you opt-out or your broadband service ends (we need 48 hours' notice to terminate). We'll have the Boost activated as soon as possible but will confirm when it goes live with an activation email. Boosts are billed in advance."
                },
                {
                    "title": "International Saver Calling Boost",
                    "content": "Applies to international calls made to standard price landline and mobile numbers, and excludes calls to international premium satellite and non-geographic numbers. <a href = 'http://help2.talktalk.co.uk/about-international-boosts'>Click here</a> for list of destinations the Boost applies to. A per call connection fee applies. (Currently 18p, increasing to 20p from 01/08/2017)"
                },
                {
                    "title": "International Extra Calling Boost",
                    "content": "1000 inclusive anytime minutes to 50 international destinations plus the Channel Islands. Applies to calls made to standard price landline numbers, and excludes calls to international premium satellite and non-geographic numbers. <a href = 'http://help2.talktalk.co.uk/about-international-boosts'>Click here</a> for list of destinations the Boost applies to. If you go over your allowance you'll be charged at a discounted rate. All non-inclusive international landline and mobile calls will be charged at a discounted rate with a per call connection fee applies. (Currently 18p, increasing to 20p from 01/08/2017)"
                },
                {
                    "title": "International Max Calling Boost",
                    "content": "1000 inclusive anytime minutes to 50 international destinations plus the Channel Islands. Applies to calls made to standard price landline and mobile numbers, and excludes calls to international premium satellite calls and non-geographic numbers. <a href = 'http://help2.talktalk.co.uk/about-international-boosts'>Click here</a> for list of destinations the Boost applies to. If you go over your allowance you'll be charged at a discounted rate. All non-inclusive international landline and mobile calls will be charged at a discounted rate with a per call connection fee applies. (Currently 18p, increasing to 20p from 01/08/2017)"
                },
                {
                    "title": "Unlimited UK Calling Boost",
                    "content": "Unlimited calls to UK landline numbers starting 01, 02, 03, and standard UK mobile numbers only (excluding 070 and 076). Excludes calls to the Channel Islands, dial-up internet, indirect access, premium mobile services & all other numbers. The maximum call time is 60 minutes per call."
                },
                {
                    "title": "Internet Boosts",
                    "content": "Fibre Speed Boost is &pound;5 on top of your monthly Faster Fibre plan charges. Price includes broadband with speeds up to 76Mb (your exact speed estimate will be given at point of sale)."
                }
            ]
        },
        {
            "heading": "Super Router",
            "caveat": [
                {
                    "title": "Super Router",
                    "content": "Each household with a fixed price plan is entitled to one Super Router. New customers automatically receive a Super Router with their Fixed Low Price Plan. Existing customers upgrading to a Fixed Low Price Plan that have not already received a Super Router from TalkTalk will need to call to get a Super Router."
                }
            ]
        },
        {
            "heading": "Pricing information",
            "caveat": [
                {
                    "title": "Pricing information",
                    "content": "All our prices correct at 29/06/2017. For full terms & conditions please visit <a href = 'http://talktalk.co.uk/policies'>\n            talktalk.co.uk/policies</a> & for prices and rates visit <a href = 'http://talktalk.co.uk/pricing'>\n            talktalk.co.uk/pricing</a>"
                }
            ]
        },
        {
            "heading": "Speed information",
            "caveat": [
                {
                    "title": "Speed information",
                    "content": "Important information about your speed estimate: \n        \n            We've signed up to Ofcom's broadband speeds voluntary code of practice and we'll always give you the \n            fastest speed your line can handle. We've estimated your line speed based on the actual speeds measured on \n            our broadband services. \n            \n            We'll do everything we can to give you a great experience online but the speed you get is likely to be \n            affected by things outside of our control like the distance your home is from the telephone exchange, the \n            specification of your computer and the condition of the wiring in your home. You may also notice a drop in \n            your speeds during peak times in the evening and at weekends when more people are using the internet."
                }
            ]
        },
        {
            "heading": "Monthly allowance",
            "caveat": [
                {
                    "title": "Monthly allowance",
                    "content": "There is a monthly billing allowance on all TalkTalk packages. If you go over your allowance you will be barred from making outgoing calls from your TalkTalk landline (excluding calls to the emergency services) and you will be unable to select on-demand TV services. You will still need to pay for all charges in excess of your allowance limit. Please check My Account for further details."
                }
            ]
        },
        {
            "heading": "HomeSafe",
            "caveat": [
                {
                    "title": "HomeSafe",
                    "content": "HomeSafe applies parental controls features to every device connected to your TalkTalk broadband connection. This protects every device capable of internet browsing without additional software downloads."
                }
            ]
        },
        {
            "heading": "Terms for existing customers for offers",
            "caveat": [
                {
                    "title": "Terms for existing customers for offers",
                    "content": "Offers for Fixed Price Plans advertised by TalkTalk are available to new and existing TalkTalk \n            customers. Existing customers need to sign a new Fixed Price Plan contract. Customers will need to be \n            active for at least 30 days on a Fixed Price Plan before taking up a new offer. \n            \n            If you are still within the minimum term of your old contract and you cancel the new contract during your \n            20 day cooling off period, you will be put back onto the equivalent of your previous package and contract term."
                }
            ]
        },
        {
            "heading": "Fibre speeds",
            "caveat": [
                {
                    "title": "Up to 4 times faster",
                    "content": "Up to speed of TalkTalk Faster Fibre Broadband compared to UK average of standard (ADSL) download speed from Ofcom UK Home broadband performance report November 2016."
                },
                {
                    "title": "Up to 8 times faster",
                    "content": "Up to speed of TalkTalk's Fibre Speed Boost compared to UK average of standard (ADSL) download speed from Ofcom UK Home broadband performance report November 2016."
                }
            ]
        },
        {
            "heading": "Your details",
            "caveat": [
                {
                    "title": "Your details",
                    "content": "We may contact you about our product and services. If you do not wish your details to be used for this purpose, please write to us c/o The Data Controller, Data Protection Office, PO Box 390, Southampton SO30 9AQ stating your full name, address, account number and mobile phone number."
                }
            ]
        },
        {
            "heading": "*Competitor Savings",
            "caveat": [
                {
                    "title": "24 month contract",
                    "content": "BT packages come with: weekend calls, unlimited wi-fi, 200GB BT Cloud,\n            Sky packages come with: 12 month contracts for Broadband and 18 months for Fibre and TV packages.\n            Virgin Media packages come with: 12 month contracts, weekend calls, 50Mb speeds and 200Mb speeds with TV\n            UFO comparison."
                },
                {
                    "title": "Fast Broadband - Save &pound;220.95 vs BT",
                    "content": "24 months cost comparison based of TalkTalk Fast Broadband (&pound;19.95/month for 24 months) compared to standard online price of BT Unlimited Broadband with Weekend Calls at &pound;23.99/month for 18 months, &pound;42.99/month thereafter &#43; &pound;50 BT reward card, 18 months min. term, &pound;9.99 hub delivery (incl. unlimited Wi-Fi, 200GB BT Cloud &amp; online player). Prices correct at 07/12/17."
                },
                {
                    "title": "Faster Fibre - Save &pound;257.75 vs BT",
                    "content": "24 months cost comparison based of TalkTalk Faster Fibre (&pound;33.50/month for 24 months) compared to standard online price of BT Unlimited Infinity 1 (up to 52Mb) with Weekend Calls at &pound;31.99/month for 18 months, &pound;41.99/month thereafter &#43; &pound;100 BT reward card, 18 months min. term, &pound;29.99 hub delivery and connection fee (incl. unlimited Wi-Fi, 200GB BT Cloud &amp; online player). Prices correct at 07/12/17."
                },
                {
                    "title": "Fast Broadband with TV - Save &pound;329.95 vs BT",
                    "content": "24 months cost comparison based of TalkTalk Fast Broadband with a TV Box (&pound;19.95/month for 24 months plus &pound;25.00 for the TV box) compared to standard online price of BT Unlimited Broadband with Weekend Calls and Starter TV + BT sport at &pound;27.49/month for 18 months and &pound;46.49 thereafter &#43; &pound;50 BT reward card, 18 months min. term, &pound;59.99 Connection fee and hub delivery (incl. unlimited Wi-Fi, 200GB BT Cloud). Prices correct at 07/12/17."
                },
                {
                    "title": "Fast Broadband with TV Plus - Save &pound;79.81 vs BT",
                    "content": "24 months cost comparison based of TalkTalk Fast Broadband with TV Select Boost and a TV Plus Box (&pound;26.95/month for 24 months plus &pound;25.00 for the TV Plus box) compared to standard online price of BT Unlimited Broadband with Weekend Calls and Starter TV + BT Sport at &pound;27.49/month for 18 months, &pound;46.49/month thereafter, 12 months min. term &#43; &pound;50 BT reward card, &pound;59.99 connection fee and hub delivery (incl. unlimited Wi-Fi, 200GB BT Cloud). Prices correct at 07/12/17."
                },
                {
                    "title": "Faster Fibre with TV - Save &pound;356.75 vs BT",
                    "content": "24 months cost comparison based of TalkTalk Fast Fibre Broadband with a TV Box (&pound;33.50/month for 24 months plus &pound;25.00 for the TV box) compared to standard online price of BT Unlimited Infinity 1 (up to 52Mb) with Weekend Calls and  Starter TV + BT Sport at &pound;35.49/month for 18 months, &pound;45.49/month thereafter &#43; &pound;100 BT reward card, 18 months min. term, &pound;69.99 connection fee, TV activation fee and hub delivery (incl. unlimited Wi-Fi, 200GB BT Cloud). Prices correct at 07/12/17."
                },
                {
                    "title": "Faster Fibre with TV Plus Box - Save &pound;79.81 vs BT",
                    "content": "24 months cost comparison based of TalkTalk Fast Fibre Broadband with TV Select Boost and a TV Plus Box (&pound;40.50/month for 24 months plus &pound;25.00 for the TV Plus Box) compared to standard online price of BT Unlimited Infinity 1 (up to 52Mb) with Weekend Calls and Starter TV &#43; BT Sport at &pound;35.49/month for 18 months, &pound;45.49/month thereafter &#43; &pound;100 BT reward card 18 months min. term, &pound;69.99 connection fee, TV activation fee and hub delivery(incl. unlimited Wi-Fi, 200GB BT Cloud). Prices correct at 07/12/17."
                },
                {
                    "title": "24 month contract </br></br>Ultra Fibre Optic with TV Plus Box - Save &pound;474.95  vs BT",
                    "content": "24 months cost comparison based of TalkTalk Ultra Fibre Optic Broadband with Entertainment Boost and a TV Plus Box (&pound;28.70/month for 24 months plus &pound;25.00 for the TV Plus Box) compared to standard online price of BT Unlimited Infinity 2 (up to 76Mb) with Weekend Calls and Starter TV at &pound;43.49/month for 18 months, &pound;59.99/month thereafter, 18 months min. term, &pound;59.99 connection fee, TV activation fee and hub delivery (incl. unlimited Wi-Fi, 1000GB BT Cloud and &pound;125 BT reward). Prices correct at 07/12/17."
                }
            ]
        },
        {
            "heading": "Copyright Information",
            "caveat": [
                {
                    "title": "Beauty and the Beast",
                    "content": "&copy; 2017  Disney Enterprises, Inc. All Rights Reserved."
                },
                {
                    "title": "The Walking Dead S8",
                    "content": "THE WALKING DEAD TM &amp; 2017 FOX and its related entities. All rights\n                 reserved. <br /> &copy;Gene Page/AMC"
                },
                {
                    "title": "Modern Family S9",
                    "content": "MODERN FAMILY &copy; 2017-2018 Twentieth Century Fox Film Corporation. All rights\n                 reserved. Artwork &copy; 2017-2018 American Broadcasting Companies. All rights reserved."
                },
                {
                    "title": "Strictly Come Dancing",
                    "content": "(C) BBC"
                },
                {
                    "title": "The X Factor",
                    "content": "This photograph is (C) Fremantle / Syco | The X Factor: SR11 on ITV"
                },
                {
                    "title": "The Great British Bake Off",
                    "content": "&copy; Channel Four Television Corporation 2017"
                },
                {
                    "title": "Transformers: The Last Knight",
                    "content": "&copy; 2017 Paramount Pictures. All Rights Reserved. Hasbro,\n                 Transformers and all related characters are trademarks of Hasbro. &copy; 2017 Hasbro. All\n                 Rights Reserved. Abbreviated version: &copy; 2017 Par. Pics. TM Hasbro"
                },
                {
                    "title": "Fast &amp; Furious 8",
                    "content": "&copy; 2017 Universal City Studios Productions LLLP. All Rights Reserved."
                },
                {
                    "title": "Wonder Woman",
                    "content": "&copy; 2017 Warner Bros. Ent. All rights reserved. TM &amp; &copy; DC Comics."
                },
                {
                    "title": "Diary of a Wimpy Kid: The Long Haul",
                    "content": "&copy; 2017 Twentieth Century Fox Film Corporation. All rights\n                 reserved. DIARY OF A WIMPY KID, WIMPY KID and the Greg Heffley image are trademarks of Wimpy Kid, Inc.\n                 Illustrations are &copy; 2010 Wimpy Kid, Inc. All rights reserved."
                },
                {
                    "title": "Peppa Pig: My First Cinema Experience",
                    "content": "&copy; 2017 Entertainment One UK Ltd"
                },
                {
                    "title": "Alien: Covenant",
                    "content": "&copy; 2017 Twentieth Century Fox Film Corporation. All rights reserved."
                },
                {
                    "title": "Baywatch",
                    "content": "&copy; 2017 Paramount Pictures. All Rights Reserved."
                },
                {
                    "title": "Baby Driver",
                    "content": "&copy; 2017 TriStar Pictures, Inc. and MRC II Distribution Company L.P. All\n                 Rights Reserved.&copy; 2017 Layout and Design Sony Pictures Home Entertainment Inc.\n                 All Rights Reserved."
                },
                {
                    "title": "King Arthur: Legend of the Sword",
                    "content": "&copy; 2017 Warner Bros. Entertainment. All rights reserved."
                },
                {
                    "title": "Pirates of the Caribbean: Salazar's Revenge",
                    "content": "&copy; 2017 Disney"
                },
                {
                    "title": "Peppa Pig",
                    "content": "Peppa Pig &copy; Astley Baker Davies Ltd/Entertainment One UK Ltd 2003."
                },
                {
                    "title": "Shimmer and Shine",
                    "content": "&copy; 2017 Viacom International Inc. All Rights Reserved. Nickelodeon, Shimmer and\n                 Shine, and all related titles, logos and characters are trademarks of Viacom International Inc."
                },
                {
                    "title": "The Russell Howard Hour",
                    "content": "&copy;Sky UK ltd"
                },
                {
                    "title": "Star Wars: The Freemaker Adventures",
                    "content": "TM &amp; &copy; The LEGO Group &amp; Lucasfilm Ltd.\n                 All rights reserved."
                },
                {
                    "title": "Vampirina",
                    "content": "&copy; Disney Media Distribution. All Rights Reserved."
                },
                {
                    "title": "Arrow S6",
                    "content": "ARROW and all related characters and elements are trademarks of and &copy; 2016 DC Comics.\n                 &copy; 2016 Warner Bros. Entertainment Inc. All rights reserved.ARROW and all related characters\n                 and elements are trademarks of and &copy; 2016 DC Comics. &copy; 2016 Warner Bros. Entertainment\n                 Inc.\n                 All rights reserved."
                },
                {
                    "title": "A League of Their Own S12",
                    "content": "&copy;Sky UK Ltd"
                },
                {
                    "title": "Blaze and the Monster Machines",
                    "content": "&copy;2017 Viacom International Inc. All Rights Reserved. Nickelodeon,\n                 Blaze and the Monster\n                 Machines and all related titles, logos and characters are trademarks of Viacom International Inc"
                },
                {
                    "title": "T2 Trainspotting",
                    "content": "&copy; Tristar Productions, Inc 2017"
                },
                {
                    "title": "Passengers",
                    "content": "&copy; 2016 Columbia Pictures Industries, Inc., LSC Film Corporation, Village Roadshow\n                 Films Global Inc. and Wanda Culture Holding Co. Limited. All Rights Reserved."
                },
                {
                    "title": "Fast and Furious 7",
                    "content": "&copy; 2015 Universal Studios. ALL RIGHTS RESERVED."
                },
                {
                    "title": "Vikings S4",
                    "content": "VIKINGS &copy; 2017 TM Productions Limited / T5 Vikings IV Productions Inc. All Rights\n                 Reserved. An Ireland-Canada Co-Production."
                },
                {
                    "title": "Minions",
                    "content": "&copy; 2015 Universal Studios. All Rights Reserved."
                },
                {
                    "title": "The Good Doctor",
                    "content": "&copy; 2017 Sony Pictures Television Inc. and\n                Disney Enterprises, Inc. All Rights Reserved"
                },
                {
                    "title": "Chris Tarrant: Extreme Railways S4",
                    "content": "Whitworth Media &amp; Group M"
                }
            ]
        }
    ]
}
